package com.org.huanjianmvp.Utils;


/**
 * 动态加载数据、静态数据
 * Created by Administrator on 2020/8/25.
 */

public class StaticValues {

    //SQLite名字
    public static String SQLiteName = "photoDB";

    //SQLite版本
    public static int SQLiteVersion = 1;

    //安检外检检验组标题
    public static String [] AJCheckGroups = {"车辆唯一性检查","车辆特征参数检查","车辆外观检查","安全装置检查"};

    //安检外检检验组内容
    public static String [] AJCheckContens = {
        "号牌号码/车辆类型","车辆品牌/型号","车辆识别代号（或整车出厂编号）","发动机号码（或电动机号码）","车辆颜色和形状",
        "核定载人数","核定载质量",
        "车身外观","外观标识、标注和标牌","外部照明和信号灯具","轮胎","号牌和号码安装","加装/改装灯具",
        "汽车安全带","机动车用三角警告牌","灭火器","行驶记录装置","车身反光标识",
    };

    //安检基本信息标题
    public static String [] AJBaseInfoTitle = {"机动车序号","品牌型号","号牌号码","中文品牌","车辆型号","英文品牌","国产/进口","制造国",
            "制造厂名称","车辆识别代号","发动机号","车辆类型","车身颜色","身份证号码","初次登记日期","最近定检日期"};

    //安检基本信息模拟数据
    public static String [] AJBaseInfoText = {"44130012867663","小型汽车","LLM275","福特牌","CAF7152A1","FT","国产","156",
            "长安福特马自达汽车有限公司","LVSHFFAL6CN211713","3332962","小型汽车","灰","451234********5938","2020/08/18 13:08:28","2020/09/18 15:38:28"};

    //安检车辆类型
    public static String [] carType = {"小型汽车","中型汽车","大型汽车","挂车","警车","军车"};

    //安检PDA检测复选项
    public static String [] PADCheck = {"F1-外观","C1-底盘","DC-动态底盘","R1-路试制动","R2-坡道驻车","R3-路试车速表"};

    //安检仪器检测复选项
    public static String [] instrumentCheck = {"S1-车速表","A1-侧滑","H1-左外灯","H2-左内灯","H3-右内灯","H4-右外灯",
            "B0-驻车","B1-一轴制动","B2-二轴制动","B3-三轴制动","B4-四轴制动","B5-五轴制动","B6-六轴制动","L1-一轴加载","L2-二轴加载",
            "L3-三轴加载","L4-四轴加载","M1-外廓尺寸"};

    //安检动态底盘检验
    public static String [] chassisDynamics = {"转向系","传动系","制动系","仪表和指示器"};

    //各省份简称
    public static String [] provinceName = {"粤","浙","苏","沪","皖","闽","晋","豫","赣","川","陕","湘","云","贵","桂","京","津","渝",
            "黑","吉","辽","蒙","冀","新","甘","青","宁","鲁","鄂","黔","滇","藏","台","琼","港","澳" };

    //环检的外检检验项
    public static String[] InspectionValues = {"车辆机械状况是否良好","排气污染控制装置是否齐全，正常","车辆是否存在烧机油或者严重冒黑烟现象",
            "(汽油车)燃油蒸发控制系统是否正常","车上仪表工作是否正常","有无可能影响安全或引起测试偏差的机械故障","车辆进、排气系统是否有任何泄露",
            "车辆的发动机、变速箱和冷却系统等有无明显的液体泄漏","是否带OBD系统","轮胎气压是否正常","轮胎是否干燥、清洁","是否关闭车上空调、暖风等附属设备",
            "是否已经中断车辆上可能影响测试正常进行的功能，如ARS、ESP、EPC牵引力控制或自动制动系统等","车辆油箱和油品是否异常","是否适合工况法检测",
            "(汽油车)曲轴箱通风系统是否正常","(柴油车)发动机燃油系统是否采用电控泵","机动车环保信息随车清单是否一致"};




}
